jpchin2000/oscilloscope/Workspace01/project.cydsn/Generated_Source/PSoC6/ADC_CH1.h
    /* Clock parameters*/
    #if (ADC_CH1_CLOCK_INTERNAL)
        #define ADC_CH1_CFG3_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_CH1_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_CH1_CLOCK_INTERNAL) */
#endif /* (ADC_CH1_TOTAL_CONFIGS > 3) */

/* ************************************************************************** */
/* End configuration 3 customizer defines                                     */
/* ************************************************************************** */

#define ADC_CH1_DEFAULT_SAMPLE_MODE_SEL      (0u)
#define ADC_CH1_FREERUNNING                  (1u)
#define ADC_CH1_HARDWARESOC                  (1u)
#define ADC_CH1_NEG_SEL_VSSA_KELVIN          (0x0uL)
#define ADC_CH1_NEG_SEL_VREF                 (0x7uL)
#define ADC_CH1_PWR_CTRL_VREF_NORMAL_PWR     (0x0uL)

/** ADC_CH1_TOTAL_CHANNELS_NUM
* This constant represents the number of input channels available for scanning.
*/
#define ADC_CH1_TOTAL_CHANNELS_NUM           (4u)

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** ADC_CH1_initVar
* The ADC_CH1_initVar variable is used to indicate
* initial configuration of this component. The variable is initialized to zero and
* set to 1 the first time ADC_CH1_Start() is called. This allows for
* component initialization without reinitialization in all subsequent calls to the
* ADC_CH1_Start() routine.
*
* If reinitialization of the component is required, then the ADC_CH1_Init() function
* can be called before the ADC_CH1_Start() or ADC_CH1_Enable()
* functions.
*/
extern uint8_t ADC_CH1_initVar;
extern uint8_t ADC_CH1_selected;
extern uint32_t ADC_CH1_currentConfig;

#define ADC_CH1_INIT_VAR_INIT_FLAG     (0x01u)

extern const ADC_CH1_CONFIG_STRUCT ADC_CH1_allConfigs[ADC_CH1_TOTAL_CONFIGS];

/* SysPm callback structure for deep sleep entry and exit.
 * Call the Cy_SysPm_RegisterCallback function with this
 * structure before calling Cy_SysPm_DeepSleep.
*/
extern cy_stc_syspm_callback_t ADC_CH1_DeepSleepCallbackStruct;

/** @} globals */

/* ************************************************************************** */
/* *******************Global MUX_SWITCH0 Definitions ************************ */
/* ************************************************************************** */
#if(ADC_CH1_CFG0_VNEG_INPUT_SEL == ADC_CH1_NEG_SEL_VSSA_KELVIN)
    /* Do not connect VSSA to VMINUS when one channel in differential mode used */
    #if((ADC_CH1_TOTAL_CHANNELS_NUM == 1u) && (ADC_CH1_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_CH1_MUX_SWITCH0_INIT      0u
    #else    /* multiple channels or one single ended channel */
        #define ADC_CH1_MUX_SWITCH0_INIT      1u
    #endif /* ((ADC_CH1_TOTAL_CHANNELS_NUM == 1u) && (ADC_CH1_CFG0_SINGLE_PRESENT == 0u)) */
#else
    #define ADC_CH1_MUX_SWITCH0_INIT          0u
#endif /* ADC_CH1_CFG0_VNEG_INPUT_SEL == ADC_CH1_NEG_SEL_VSSA_KELVIN */

/* ************************************************************************** */
/* Begin configuration 0 calculated defines                                   */
/* ************************************************************************** */
#define ADC_CH1_CFG0_SAMPLE_TIME01_INIT \
        ((ADC_CH1_CFG0_APERTURE_TIME0 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
        | (ADC_CH1_CFG0_APERTURE_TIME1 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

#define ADC_CH1_CFG0_SAMPLE_TIME23_INIT \
        ((ADC_CH1_CFG0_APERTURE_TIME2 \
        << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
        | (ADC_CH1_CFG0_APERTURE_TIME3 \
        << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

/* Enable soc pin if used */
#define ADC_CH1_CFG0_DSI_TRIGGER_EN_INIT \
        (ADC_CH1_CFG0_USE_SOC \
        << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

/* Set soc operation to edge or level based on sample mode */
#if(ADC_CH1_CFG0_FREERUNNING == ADC_CH1_FREERUNNING)
    #define ADC_CH1_CFG0_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
#else /* Edge trigger */
    #define ADC_CH1_CFG0_DSI_TRIGGER_LEVEL_INIT    (0u)
#endif /* End ADC_CH1_CFG0_FREERUNNING == ADC_CH1_FREERUNNING */

/* Set SE_NEG_INPUT */
#if(ADC_CH1_CFG0_VNEG_INPUT_SEL == ADC_CH1_NEG_SEL_VSSA_KELVIN)
    #define ADC_CH1_CFG0_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_CH1_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
#elif(ADC_CH1_CFG0_VNEG_INPUT_SEL == ADC_CH1_NEG_SEL_VREF)

    /* Do not connect VNEG to VREF when one channel in differential mode used */
    /* Only needed for config 0 since 2+ configs == 2+ channels */
    #if((ADC_CH1_CFG0_CHANNEL_COUNT == 1u) && (ADC_CH1_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_CH1_CFG0_SE_NEG_INPUT_INIT     0u
    #else    /* multiple channels or one single channel */
        #define ADC_CH1_CFG0_SE_NEG_INPUT_INIT     (ADC_CH1_NEG_SEL_VREF \
                                                            << SAR_CTRL_NEG_SEL_Pos )
    #endif /* (ADC_CH1_CFG0_CHANNEL_COUNT == 1u) && (ADC_CH1_CFG0_CHANNELS_MODE != 0u) */
#elif (ADC_CH1_CFG0_SINGLE_PRESENT != 0u)
    #define ADC_CH1_CFG0_SE_NEG_INPUT_INIT         ADC_CH1_CFG0_NEG_OTHER
#else
    #define ADC_CH1_CFG0_SE_NEG_INPUT_INIT         0u
#endif /* ADC_CH1_CFG0_VNEG_INPUT_SEL == ADC_CH1_NEG_SEL_VSSA_KELVIN */

#if(ADC_CH1_TOTAL_CHANNELS_NUM > 1u)
    #define ADC_CH1_CFG0_NEG_OTHER                 (uint16)((uint16)ADC_CH1_SARMUX__VNEG0 << SAR_CTRL_NEG_SEL_Pos)
    #define ADC_CH1_CFG0_SWITCH_CONF_INIT          0u
#else /* Disable SAR sequencer from enabling routing switches in single channel mode */
    #define ADC_CH1_CFG0_SWITCH_CONF_INIT          SAR_CTRL_SWITCH_DISABLE_Msk
    #define ADC_CH1_CFG0_NEG_OTHER                 0u
#endif /* ADC_CH1_CFG0_CHANNEL_COUNT > 1u */

/* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
#if(ADC_CH1_TOTAL_CHANNELS_NUM == 1u)
    #define ADC_CH1_CFG0_HW_CTRL_NEGVREF_INIT      0u
#else
    #define ADC_CH1_CFG0_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk
#endif /* ADC_CH1_CFG0_CHANNEL_COUNT == 1u */

#define ADC_CH1_CFG0_POWER_INIT  (ADC_CH1_PWR_CTRL_VREF_NORMAL_PWR)

/* SAMPLE_CTRL initial values */
#define ADC_CH1_CFG0_SE_RESULT_FORMAT_INIT \
        (ADC_CH1_CFG0_SINGLE_ENDED_FORMAT \
        << SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos)

