jpchin2000/oscilloscope/Workspace01/project.cydsn/Generated_Source/PSoC6/ADC_CH1.h
    #define ADC_CH1_CFG3_TRIGGER_OUT_INIT      (0u)
    #define ADC_CH1_CFG3_UAB_SCAN_MODE_INIT    (0u)

    #define ADC_CH1_CFG3_VREF_POWER_INIT  \
            (ADC_CH1_CFG3_VREF_PWR \
            << SAR_CTRL_PWR_CTRL_VREF_Pos)

    #define ADC_CH1_CFG3_COMP_PWR_INIT  \
            (ADC_CH1_CFG3_COMP_PWR \
            << SAR_CTRL_COMP_PWR_Pos)

    #define ADC_CH1_CFG3_COMP_DLY_INIT  \
            (ADC_CH1_CFG3_COMP_DLY \
            << SAR_CTRL_COMP_DLY_Pos)

    #define ADC_CH1_CFG3_CTRL_INIT  \
            (ADC_CH1_CFG3_VREF_POWER_INIT \
            | ADC_CH1_CFG3_VREF_SEL_MASK \
            | ADC_CH1_CFG3_SE_NEG_INPUT_INIT \
            | ADC_CH1_CFG3_HW_CTRL_NEGVREF_INIT \
            | ADC_CH1_CFG3_COMP_DLY_INIT \
            | SAR_CTRL_REFBUF_EN_Msk \
            | ADC_CH1_CFG3_COMP_PWR_INIT \
            | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
            | ADC_CH1_CFG3_SWITCH_CONF_INIT )


    #define ADC_CH1_CFG3_SAMPLE_CTRL_INIT \
            (ADC_CH1_CFG3_SE_RESULT_FORMAT_INIT \
            | ADC_CH1_CFG3_DIFF_RESULT_FORMAT_INIT \
            | ADC_CH1_CFG3_AVG_SAMPLES_NUM_INIT \
            | ADC_CH1_CFG3_AVG_MODE_INIT \
            | ADC_CH1_CFG3_DSI_TRIGGER_LEVEL_INIT \
            | ADC_CH1_CFG3_DSI_TRIGGER_EN_INIT \
            | ADC_CH1_CFG3_UAB_SCAN_MODE_INIT \
            | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
            | ADC_CH1_CFG3_TRIGGER_OUT_INIT \
            | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
    )

    #define ADC_CH1_CFG3_RANGE_THRES_INIT \
            (ADC_CH1_CFG3_LOW_LIMIT \
            | (uint32)((uint32)ADC_CH1_CFG3_HIGH_LIMIT \
            << SAR_RANGE_THRES_RANGE_HIGH_Pos))

    #define ADC_CH1_CFG3_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)ADC_CH1_CFG3_RANGE_COND

    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
    */
    #define ADC_CH1_CFG3_MISC_CONFIG_INIT \
            (ADC_CH1_CFG3_FREERUNNING )

#endif /* ADC_CH1_TOTAL_CONFIGS > 3 */

/* ************************************************************************** */
/* End configuration 3 calculated defines                                     */
/* ************************************************************************** */

/******************************************************************************
* Function Name: ADC_CH1_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
__STATIC_INLINE void ADC_CH1_Enable(void)
{
    Cy_SAR_Enable(ADC_CH1_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_CH1_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the ADC_CH1_Stop() API to halt conversions. Instead use the
* ADC_CH1_StopConvert() API. If you use the ADC_CH1_Stop() API
* to halt conversions then later use the ADC_CH1_Start() and
* ADC_CH1_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The ADC_CH1_StopConvert() API will enable
* the ADC_CH1 to complete the current scan of channels. After the
* channel scan is complete, the ADC_CH1 will stop all conversions, which
* can be detected by the use of an ISR or the ADC_CH1_IsEndConversion()
* function.
*
*******************************************************************************/
__STATIC_INLINE void ADC_CH1_Stop(void)
{
    Cy_SAR_Disable(ADC_CH1_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_CH1_StopConvert
****************************************************************************//**
*
* \brief Forces the ADC_CH1 to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_CH1_StopConvert(void)
{
    Cy_SAR_StopConvert(ADC_CH1_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_CH1_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The ADC_CH1 channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int16_t ADC_CH1_GetResult16(uint32_t chan)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_CH1_allConfigs[ADC_CH1_currentConfig].numChannels);

    return Cy_SAR_GetResult16(ADC_CH1_SAR__HW, chan);
}

/*******************************************************************************
* Function Name: ADC_CH1_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The ADC_CH1 channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t ADC_CH1_GetResult32(uint32_t chan)
{
    int32_t finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_CH1_allConfigs[ADC_CH1_currentConfig].numChannels);

    finalResult = Cy_SAR_GetResult32(ADC_CH1_SAR__HW, chan);

    return finalResult;
}

/*******************************************************************************
* Function Name: ADC_CH1_SetLowLimit
****************************************************************************//**
*
* \brief Sets the low limit parameter for a limit condition.
*
* \param lowLimit The low limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_CH1_SetLowLimit(uint32_t lowLimit)
{
    Cy_SAR_SetLowLimit(ADC_CH1_SAR__HW, lowLimit);
}

